app/controllers/admin/pages_controller.rb

SELECT * FROM `pages` WHERE (parent_id IS NULL OR parent_id=0) ORDER BY id ASC
SELECT count(*) AS count_all FROM `pages` WHERE (`pages`.parent_id = 1)
---
  def index
    @pages = Page.find(:all, :order => "position DESC")

SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
---
  def edit
    @page = Page.find(params[:id])

INSERT INTO `pages` (`name`, `permalink`, `position`, `created_at`, `title`, `published`, `updated_at`, `lft`, `template`, `parent_id`, `path`, `content`, `rgt`) VALUES(NULL, 'main', 1, '2010-03-03 14:51:08', 'Главнющая', 1, '2010-03-03 14:51:08', 1, '', NULL, NULL, '<p>\r\n	adsf</p>\r\n', 2)
---
  def create
    #@parent_page = Page.find(params[:page][:parent_id])

    @page = Page.new(params[:page])
    #@page.move_to_child_of(@parent_page)

    respond_to do |wants|
      if @page.save

UPDATE `pages` SET `updated_at` = '2010-03-03 15:00:58', `permalink` = 'asdf' WHERE `id` = 3
---
  def update
    respond_to do |wants|
      if @page.update_attributes(params[:page])

UPDATE `pages` SET position=1 WHERE (id='7')
---
  def sort
#render :text => params['.pages']
    if params['.pages']
      params['.pages'].each_with_index do |id, index|
        Page.update_all(['position=?', index+1], ['id=?', id])

SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
SELECT max(`pages`.position) AS max_position FROM `pages` WHERE (1 = 1 AND (pages.parent_id IS NULL) AND pages.position IS NOT NULL)
---
    def find_page
      @page = Page.find(params[:id])